app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY title
SELECT "movies".* FROM "movies" WHERE "movies"."rating" = 'G'  ORDER BY release_date
---
    def index
      @all_ratings = Movie.all_ratings
      if params[:ratings].nil?
        @ratings_to_show = @all_ratings
      else
        @ratings_to_show = params[:ratings].keys
      end

      @movie_title_header_color = ''
      @release_date_header_color = ''
      @movie_title_header = params[:movie_title_header]
      @release_date_header = params[:release_date_header]
      @new_ratings = params[:new_ratings]
      if @movie_title_header == "1"
        @movie_title_header_color = 'hilite bg-warning'
        @release_date_header_color = ''
        @ratings_to_show = @new_ratings
        @movies = Movie.with_ratings(@new_ratings).order("title")
      elsif @release_date_header == "1"
        @release_date_header_color = 'hilite bg-warning'
        @movie_title_header_color = ''
        @ratings_to_show = @new_ratings
        @movies = Movie.with_ratings(@new_ratings).order("release_date")